Coursera
計算機程式設計 (Computer Programming)
第 7 周
测验: Final Exam
20 个问题

############################

第 1 个问题
以下何者為有效變數名稱?

1926sum
234@@
_counter
a&bdef

正确 
_counter

############################

第 2 个问题
如果我們在主程式內宣告一個整數變數 a 但是沒有給初值，那麼當我們第一次使用 a 的值為何?

0
任意值
1
NULL

正确 
任意值

############################

第 3 个问题
如果 if 的條件是 (-1)，則會執行何者?

then
視編譯器而定
else
視作業系統而定

正确 
else

############################

第 8 个问题
如果 a 的宣告是 int *a，則 a[i] 的意義等同於?

&(a + i)
(&a) + i
(*a) + i
*(a + i)

正确
*(a + i)

############################

第 9 个问题
如果 a 的宣告是 int a[2][3]，則 &(a[i]) 的值等同於?

&(a[i][0])
&(a + i) * 3
a + i * 2
&(a) + i * 3 * sizeof(int)

正确
&(a[i][0])

############################

第 12 个问题
如果 a 的型別為 int 且值為 12，b 的型別為 int 且值為 5，d 的型別為 double 且值為 24.0，則 d / (a / b) 的型別及值為何?

int, 10
double, 10.0000
double, 12.0000
int, 12

正确
double, 12.0000

############################

第 18 个问题
現有 char string[100]。如果所有字串操作均為合法記憶體位址，則下列何者恆為真?

strlen(string) 大於 sizeof(string)
以上皆非
strlen(string) 等於 sizeof(string)
strlen(string) 小於 sizeof(string)

正确
strlen(string) 等於 sizeof(string)

############################

第 20 个问题
假設 a 為一任意型別變數，則下列何者恆為真?

*(&a) == a
&(&a) == a
&(*a) == a
*(*a) == a

正确
*(&a) == a