import numpy as np

def card_shuffle(card_ls):
    even=True if len(card_ls)%2 == 0 else False
    half1_len = len(card_ls)//2 if even else len(card_ls)//2 + 1
    half1_ls = card_ls[0:half1_len]
    half2_ls = card_ls[half1_len:]
    shuffled_ls = []
    for i in range(fist_half_len-1):
        shuffled_ls.append(half1_ls[i])
        shuffled_ls.append(half2_ls[i])
    shuffled_ls.append(half1_ls[-1]) if not even else None
    return shuffled_ls

file_from = './in.txt'
with open(file_from, "r") as f:
    for line in f:
        try:            
            print(line.strip().split())
            card_ls = map(int, line.strip().split())
            print(card_ls)
            shuffled_ls = card_shuffle(card_ls)
            print(shuffled_ls)
        except:
            None
        

"""
寫一個程式來模擬洗牌。
我們將用一個指標陣列 (array of pointer) 來代表牌組。
排組內的每張牌都有一個 1 至 10000 的整數點數。
陣列的第 i 個元素代表牌組中的第 i 張牌；
也就是說，如果牌組的第 i 張牌的點數為 6，那麼陣列第 i 個指標所指到的值就會是 6。
如果指標指到 NULL 代表那是牌組的末端 (end of deck)，代表後面將不會有任何牌。
我們保證牌組中最多只有 9999 張牌。

現在我們想要洗牌。首先先將 n 張牌分成兩組，
第一組中包含了前半 (n/2) 的牌；第二組則包含剩下的牌。
例如有 9 張牌的話，分堆後第一組牌有 5 張牌，而第二組牌則有 4 張牌。
接著我們將兩組牌合為一組，順序為：
第一組的第一張牌、第二組的第一張牌、第一組的第二張牌、第二組的第二張牌，以此類推。
也就是說，我們交替著擺，將把兩組牌合為一組。

輸入範例
1 2 3 4 5
輸出範例
1 4 2 5 3

######################

8 10 3 4 1 6 2 9 7 5

10 17 1 6 13 16 9 5 7 15 2 14 8 12 3 11 4

33 40 44 50 4 36 28 30 19 8 3 12 18 42 29 41 5 14 51 1 15 34 2 21 20 6 24 25 31 46 13 47 49 35 11 38 10 17 43 32 26 39 45 16 27 37 7 48 9 23 22

77 40 58 33 20 101 79 25 43 9 5 98 92 100 80 3 52 60 76 26 94 6 90 29 75 85 49 17 74 69 13 30 56 53 14 38 102 64 51 32 78 95 55 28 18 47 48 88 91 15 68 8 82 34 66 22 37 42 41 39 46 45 67 10 93 72 35 31 16 36 86 70 21 59 50 27 63 12 103 73 54 1 61 97 44 19 83 81 99 65 84 89 96 62 24 4 23 2 57 7 87 71 11

39 13 92 69 58 96 143 153 54 199 89 159 68 141 40 198 187 10 123 173 126 6 14 205 32 183 52 37 157 106 138 94 193 16 119 148 114 11 33 53 87 192 206 43 84 164 51 80 116 107 115 49 110 151 129 186 59 70 88 149 191 145 120 184 81 169 75 180 55 4 20 91 102 163 112 127 104 150 136 158 19 146 61 17 128 155 168 202 98 147 34 86 27 5 113 97 171 30 47 144 73 78 28 167 62 177 31 124 132 72 50 82 176 134 21 165 170 166 100 154 140 182 9 196 65 63 41 45 175 23 67 195 188 130 108 194 161 95 201 179 122 203 77 76 174 3 66 117 44 178 24 181 105 18 1 204 190 26 60 74 83 118 172 8 29 156 139 135 64 200 38 35 2 101 121 42 160 137 197 25 207 99 103 131 162 125 109 7 133 90 71 93 57 46 79 48 36 142 189 111 185 85 22 152 12 15 56
"""